// Vector2dEx.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include "Vector2D.h"
using namespace std;

int main()
{
	Vector2D v1(2,3);
	Vector2D v2(4,5);
	Vector2D v3;
	v1.print();
	cout << "**\n";
	v2.print();
	cout << "=\n" << v1.scalarMult(v2) << endl;
	cout << "===============================\n";
	v1.print();
	cout << "+\n";
	v2.print();
	cout << "=\n";
	v3 = v1.sum(v2);
	v3.print();
	cout << "===============================\n";
	v1.print();
	cout << "-\n";
	v2.print();
	cout << "=\n";
	v3 = v1.sub(v2);
	v3.print();
	cout << "===============================\n";
	v1.print();
	cout << "*\n5\n";
	cout << "=\n";
	v3 = v1.mult(5);
	v3.print();

}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
