// Vector2dEx.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include "Vector2D.h"
using namespace std;

int main()
{
	Vector2D v0;
	Vector2D v1(2, 4);
	Vector2D v2(0, 1, 4, 5);
	cout << "v0: ";
	v0.print();
	cout << "v1: ";
	v1.print();
	cout << "v2: ";
	v2.print();
	cout << "v0=v1+v2: ";
	v0 = v1;
	v0.sum(v2);
	v0.print();
	cout << "v0=(0,0)\n";
	v0.setx(0);
	v0.sety(0);
	cout << "v0.angle(v1): " << v0.angle(v1) << endl;
	cout << "v1.angle(v2): " << v1.angle(v2) << endl;
	cout << "v1.scalarMult(v2): " << v1.scalarMult(v2) << endl;
	cout << "v1*=3: ";
	v1.mult(3);
	v1.print();
	cout << "v2.angle(v1)" << v2.angle(v1) << endl;

}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
